Revit 2026 API
ReferenceIntersector Class
 A class used to find and return elements that intersect a ray created from an origin point and direction.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ReferenceIntersector
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ReferenceIntersector : IDisposable
Public Class ReferenceIntersector
	Implements IDisposable
public ref class ReferenceIntersector : IDisposable
type ReferenceIntersector =
    class
        interface IDisposable
    end
The ReferenceIntersector type exposes the following members.
Constructors
Name | Description
ReferenceIntersector(View3D) |  Constructs a ReferenceIntersector which is set to return intersections from all elements and representing all reference target types.
ReferenceIntersector(ElementFilter, FindReferenceTarget, View3D) |  Constructs a ReferenceIntersector which is set to return intersections from any element which passes an input filter.
ReferenceIntersector(ElementId, FindReferenceTarget, View3D) |  Constructs a ReferenceIntersector which is set to return intersections from a single target element only.
ReferenceIntersector(ICollection<ElementId>, FindReferenceTarget, View3D) | Initializes a new instance of the ReferenceIntersector class
Top
Properties
Name | Description
FindReferencesInRevitLinks |  Determines if references inside Revit Links should be found.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TargetType |  The type of reference to find.
ViewId |  The id of the 3D view used for evaluation.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ReferenceIntersector
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Find |  Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria.
FindNearest |  Projects a ray from the origin along the given direction, and returns the nearest reference from intersected elements which match the ReferenceIntersector's criteria.
GetFilter |  Gets the ElementFilter used in intersection testing.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetTargetElementIds |  Gets the set of ElementIds to test from in intersection testing.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetFilter |  Sets the ElementFilter used in intersection testing.
SetTargetElementIds
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
An instance of this class can be constructed to return any 3D geometric element that intersects the ray created by the origin and direction, or to return a subset of elements based on filtering and flags. The caller can opt to filter the results using an ElementFilter, or by applying a specific list of acceptable elements. The caller can also specify the type of object to be returned, which might be whole elements, geometry objects, or a combination. In all cases the caller is required to supply a 3D view for evaluation; the view and visibility settings on the input view will determine if a particular element is returned (for example, hidden elements will never be returned by this tool, nor will elements whose geometry is outside the section box of the view).
The class is configured so that a single instance can be constructed and used for multiple evaluations of different rays. The results of the evaluation are not preserved between invocations on the same ReferenceIntersector.
The class also offers an option to return element results encountered in Revit Links. When the FindReferencesInRevitLinks flag is set, the results may include elements in the host document and in any RevitLinkInstance encountered, depending on the other flags set. See the remarks for FindReferencesInRevitLinks for details on how the flags affect the results obtained from links.
See Also
Reference
Autodesk.Revit.DB Namespace